IDEA Open Model
ConcreteULSCheckResultInteractionEc2.CheckValueShearAndTorsion Property
Compatible with IDEA StatiCa v 10.1
 Calculated value of the exploitation of the cross-section (for interaction of shear and torsion) related to the limit value
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public double CheckValueShearAndTorsion { get; set; }
Public Property CheckValueShearAndTorsion As Double
	Get
	Set
public:
property double CheckValueShearAndTorsion {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ConcreteULSCheckResultInteractionEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace